## Importando librerías

In [1]:
import pandas as pd
import numpy as np

### Creación de Diccionario con diferentes valores

In [2]:
dict = {'Col1':[1,2,3,np.nan],
        'Col2':[4,np.nan,6,7],
        'Col3':['a','b','c',None]}

In [3]:
df = pd.DataFrame(dict)

In [4]:
df

   Col1  Col2  Col3
0   1.0   4.0     a
1   2.0   NaN     b
2   3.0   6.0     c
3   NaN   7.0  None

#### Validar si es nulo

In [5]:
df.isnull()

    Col1   Col2   Col3
0  False  False  False
1  False   True  False
2  False  False  False
3   True  False   True

In [6]:
df.isnull()*1

   Col1  Col2  Col3
0     0     0     0
1     0     1     0
2     0     0     0
3     1     0     1

In [7]:
df.fillna('Missing')

      Col1     Col2     Col3
0      1.0      4.0        a
1      2.0  Missing        b
2      3.0      6.0        c
3  Missing      7.0  Missing

In [10]:
df.fillna('A')

  Col1 Col2 Col3
0  1.0  4.0    a
1  2.0    A    b
2  3.0  6.0    c
3    A  7.0    A

In [11]:
df.interpolate()

C:\Users\Asus\AppData\Local\Temp\ipykernel_1236\4002874584.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate()

   Col1  Col2  Col3
0   1.0   4.0     a
1   2.0   5.0     b
2   3.0   6.0     c
3   3.0   7.0  None

In [12]:
df.dropna()

   Col1  Col2 Col3
0   1.0   4.0    a
2   3.0   6.0    c